空にある何かを見つめてたら

소라니 아루 나니카오 미츠메테타라

하늘에 있는 무언가를 바라보고 있으니

 

それは星だって君がおしえてくれた

소레와 호시닷테 키미가 오시에테 쿠레타

그건 별이라고 네가 알려주었어

 

まるでそれは僕らみたいに　寄り添ってる

마루데 소레와 보쿠라미타이니 요리솟테루

그건 마치 우리들처럼 꼭 붙어 있어

 

それを泣いたり笑ったり繋いでいく

소레오 나이타리 와랏타리 츠나이데이쿠

그걸 울고 웃으며 계속 이어가고 있어

 

何十回　何百回　ぶつかりあって

난쥬-카이 난뱌쿠카이 부츠카리앗테

몇 십번, 몇 백번 맞부딪쳐서

 

何十年　何百年　昔の光が

난쥬-넨 난뱌쿠넨 무카시노 히카리가

몇 십 년, 몇 백 년 옛날의 빛이

 

星自身も忘れたころに

호시 지신모 와스레타 코로니

별 자신도 잊었을 즈음에

 

僕らに届いてる

보쿠라니 토도이테루

우리들에게 닿는 거야

 

僕ら見つけあって　手繰りあって　同じ空

보쿠라 미츠케앗테 타구리앗테 오나지 소라

우리는 서로를 찾아내고 끌어당기며 같은 하늘을

 

輝くのだって　二人だって　約束した

카가야쿠노 닷테 후타리닷테 야쿠소쿠시타

빛내자고, 함께 있자고 약속 했어

 

遥か遠く終わらないべテルギウス

하루카 토오쿠 오와라나이 베테루기우스

아득히 머나먼 끝나지 않는 베텔기우스

*(밤하늘에서 여덟 번째로 밝으면서 오리온자리에서 두 번째로 밝은 별)

 

誰かに繋ぐ魔法

다레카니 츠나구 마호-

누군가에게 잇는 마법

 

僕ら　肩並べ　手取り合って　進んでく

보쿠라 카타나라베 테도리앗테 스슨데쿠

우리는 어깨를 나란히 하고 손을 마주잡으며 나아가

 

辛い時だって　泣かないって　誓っただろう

츠라이토키닷테 나카나잇테 치캇타다로-

힘들 때에도 울지 않겠다고 맹세했잖아

 

遥か遠く終わらないべテルギウス

하루카 토오쿠 오와라나이 베테루기우스

아득히 머나먼 끝나지 않는 베텔기우스

 

君にも見えるだろう　祈りが

키미니모 미에루다로- 이노리가

너에게도 보일 거야, 기도가

 

 

記憶を辿るたび　蘇るよ

키오쿠오 타도루 타비 요미가에루요

기억을 더듬을 때마다 되살아날 거야

 

君がいつだってそこに居てくれること

키미가 이츠닷테 소코니 이테쿠레루 코토

네가 언제라도 그곳에 있어주는 것

 

まるでそれは星の光と　同じように

마루데 소레와 호시노 히카리토 오나지요-니

마치 그건 별의 빛처럼

 

今日に泣いたり笑ったり繋いでいく

쿄-니 나이타리 와랏타리 츠나이데 이쿠

오늘을 울고 웃으며 계속 이어가고 있어

 

何十回　何百回　ぶつかりあって

난쥬-카이 난뱌쿠카이 부츠카리앗테

몇 십번, 몇 백번 부딪쳐서

 

何十年　何百年　昔の光が

난쥬-넨 난뱌쿠넨 무카시노 히카리가

몇 십 년, 몇 백 년 옛날의 빛이

 

僕自身も忘れたころに

보쿠 지신모 와스레타 코로니

나 자신도 잊어버렸을 즈음에

 

僕らを照らしてる

보쿠라오 테라시테루

우리를 비추고 있어

 

僕ら見つけあって　手繰りあって　同じ空

보쿠라 미츠케앗테 타구리앗테 오나지 소라

우리는 서로를 찾아내고, 끌어당기며 똑같은 하늘을

 

輝くのだって　二人だって　約束した

카가야쿠노닷테 후타리닷테 야쿠소쿠시타

빛내자고, 함께 있자고 약속 했어

 

遥か遠く終わらないべテルギウス

하루카 토오쿠 오와라나이 베테루기우스

아득히 머나먼 끝나지 않는 베텔기우스

 

誰かに繋ぐ魔法

다레카니 츠나구 마호-

누군가에게 잇는 마법

 

どこまで　いつまで　生きられるか

도코마데 이츠마데 이키라레루카

어디까지, 언제까지 살 수 있을까

 

君が不安になるたびに強がるんだ

키미가 후안니 나루타비니 츠요가룬다

네가 불안해할 때마다 강한 척을 해

 

大丈夫　僕が横にいるよ

다이죠-부 보쿠가 요코니 이루요

괜찮아, 내가 곁에 있을게

 

見えない線を繋ごう

미에나이 센오 츠나고-

보이지 않는 선을 잇자

 

 

僕ら見つけあって　手繰りあって　同じ空

보쿠라 미츠케앗테 테구리앗테 오나지 소라

우리는 서로를 찾아내고, 끌어당기며 똑같은 하늘을

 

輝くのだって　二人だって　約束した

카가야쿠노닷테 후타리닷테 야쿠소쿠시타

빛내자고, 함께 있자고 약속 했어

 

遥か遠く終わらないべテルギウス

하루카 토오쿠 오와라나이 베테루기우스

아득히 머나먼 끝나지 않는 베텔기우스

 

誰かに繋ぐ魔法

다레카니 츠나구 마호-

누군가에게 잇는 마법

 

僕ら　肩並べ　手取り合って　進んでく

보쿠라 카타나라베 테도리앗테 스슨데쿠

우리는 어깨를 나란히 하고 손을 마주잡으며 나아가

 

辛い時だって　二人だって　誓っただろう

츠라이토키닷테 후타리닷테 치캇타다로-

힘들 때에도 함께 하자고 맹세했잖아

 

遥か遠く終わらないべテルギウス

하루카 토오쿠 오와라나이 베테루기우스

아득히 머나먼 끝나지 않는 베텔기우스

 

君にも見えるだろう　祈りが

키미니모 미에루다로- 이노리가

너에게도 보이지, 기도가

 

空にある何かを見つめてたら

소라니 아루 나니카오 미츠메테타라

하늘에 있는 무언가를 바라보고 있으니

 

それは星だって君がおしえてくれた

소레와 호시닷테 키미가 오시에테쿠레타

그건 별이라고 네가 알려주었어
[출처] 유우리(優里) - 베텔기우스(ベテルギウス) 가사해석,듣기|작성자 리뷰
